УправлениеПаркомАттракционов/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтактнойИнформации</name>
  <enumValues>
    <name>Адрес</name>
  </enumValues>
  <enumValues>
    <name>Телефон</name>
  </enumValues>
  <enumValues>
    <name>АдресЭлектроннойПочты</name>
  </enumValues>
  <enumValues>
    <name>Skype</name>
  </enumValues>
  <enumValues>
    <name>ВебСтраница</name>
  </enumValues>
  <enumValues>
    <name>Факс</name>
  </enumValues>
  <enumValues>
    <name>Другое</name>
  </enumValues>
</mdclass:Enum>

УправлениеПаркомАттракционов/src/CommonModules/УправлениеКонтактнойИнформацииПА/Module.bsl
#Область ПрограммныйИнтерфейс

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов
//
// Параметры:
//  КодыЯзыков - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.КодыЯзыков
//  Элементы   - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.Элементы
//  ТабличныеЧасти - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.ТабличныеЧасти
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт
	
    // Контактная информация справочника "Контактные лица" 
    Элемент = Элементы.Добавить(); 
    Элемент.ИмяПредопределенногоВида = "СправочникКлиенты";
    Элемент.ЭтоГруппа = Истина;
    Элемент.Используется = Истина;
    Элемент.Наименование = 
    	НСтр("ru = 'Контактная информация справочника ""Клиенты""'", ОбщегоНазначения.КодОсновногоЯзыка());
    
    // Телефон Клиента
    Элемент = Элементы.Добавить();
    Элемент.Родитель = "СправочникКлиенты";
    Элемент.ИмяГруппы = "СправочникКлиенты";
    Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
    Элемент.Используется = Истина;
    Элемент.ИмяПредопределенногоВида = "ТелефонКлиента";
    Элемент.ИдентификаторДляФормул = "ТелефонКлиента";
    Элемент.ВидРедактирования = "ПолеВвода";
    Элемент.ОтображатьВсегда = Истина;
    Элемент.Наименование = НСтр("ru = 'Телефон'", ОбщегоНазначения.КодОсновногоЯзыка());
    
    // Адрес электронной почты Клиента
    Элемент = Элементы.Добавить();
    Элемент.Родитель = "СправочникКлиенты";
    Элемент.ИмяГруппы = "СправочникКлиенты";
    Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
    Элемент.Используется = Истина;
    Элемент.ИмяПредопределенногоВида = "АдресЭлектроннойПочтыКлиента";
    Элемент.ИдентификаторДляФормул = "АдресЭлектроннойПочтыКлиента";
    Элемент.ВидРедактирования = "ПолеВвода";
    Элемент.ОтображатьВсегда = Истина;
    Элемент.Наименование = НСтр("ru = 'Адрес электронной почты'", ОбщегоНазначения.КодОсновногоЯзыка());    	
    
    // Телеграм Клиента
    Элемент = Элементы.Добавить();
    Элемент.Родитель = "СправочникКлиенты";
    Элемент.ИмяГруппы = "СправочникКлиенты";
    Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.ВебСтраница;
    Элемент.Используется = Истина;
    Элемент.ИмяПредопределенногоВида = "ТелеграмКлиента";
    Элемент.ИдентификаторДляФормул = "ТелеграмКлиента";
    Элемент.ВидРедактирования = "ПолеВвода";
    Элемент.ОтображатьВсегда = Истина;
    Элемент.Наименование = НСтр("ru = 'Телеграм'", ОбщегоНазначения.КодОсновногоЯзыка());
	
КонецПроцедуры

#КонецОбласти
